Fase 5/nerd/app/controllers/events_controller.rb

  def show
    @event = Event.find params[:id]
    @subject = Subject.find params[:subject_id]
---
SELECT * FROM "events" WHERE ("events"."id" = 1)
SELECT * FROM "subjects" WHERE ("subjects"."id" = 2031241678)

  def new
    @event = Event.new
    @subject = Subject.find params[:subject_id]
---
SELECT * FROM "subjects" WHERE ("subjects"."id" = 2031241678)

  def create
    @subject = Subject.find params[:subject_id]
    @event = Event.new params[:event]
    if @event.save
---
SELECT * FROM "subjects" WHERE ("subjects"."id" = 2031241678)
INSERT INTO "events" ("created_at", "title", "body", "updated_at", "time", "date", "subject_id") VALUES('2009-11-25 19:56:19', 'Bla', '', '2009-11-25 19:56:19', NULL, NULL, 2031241678)

  def destroy
    @event = Event.find params[:id]
    @event.destroy
---
SELECT * FROM "events" WHERE ("events"."id" = 4)
DELETE FROM "events" WHERE "id" = 4

  def edit
    @event = Event.find params[:id]
    @subject = Subject.find params[:subject_id]
---
SELECT * FROM "events" WHERE ("events"."id" = 5)
SELECT * FROM "subjects" WHERE ("subjects"."id" = 2089548103)

  def update
    @event = Event.find params[:id]
    @subject = Subject.find params[:subject_id]
    if @event.update_attributes params[:event]
---
SELECT * FROM "events" WHERE ("events"."id" = 5)
SELECT * FROM "subjects" WHERE ("subjects"."id" = 2089548103)
UPDATE "events" SET "updated_at" = '2009-11-25 19:59:31', "title" = 'Premiação dos Artilheiros', "time" = '2000-01-01 20:00:00', "body" = 'Vencedores do prêmio: