Fase 5/nerd/app/controllers/records_controller.rb

  def show
    @record = Record.find params[:id]
    @subject = Subject.find params[:subject_id]
---
SELECT * FROM "records" WHERE ("records"."id" = 1)
SELECT * FROM "subjects" WHERE ("subjects"."id" = 2031241678)

  def new
    @record = Record.new
    @subject = Subject.find params[:subject_id]
---
SELECT * FROM "subjects" WHERE ("subjects"."id" = 2031241678)

  def create
    @subject = Subject.find params[:subject_id]
    @record = Record.new params[:record]
    if @record.save
---
SELECT * FROM "subjects" WHERE ("subjects"."id" = 2031241678)
INSERT INTO "records" ("created_at", "title", "body", "updated_at", "subject_id") VALUES('2009-11-25 21:18:14', 'Pimba na chulepa', 'PIMBA!!!1', '2009-11-25 21:18:14', 2031241678)

  def destroy
    @record = Record.find params[:id]
    @record.destroy
---
SELECT * FROM "records" WHERE ("records"."id" = 3)
DELETE FROM "records" WHERE "id" = 3

  def edit
    @record = Record.find params[:id]
    @subject = Subject.find params[:subject_id]
---
SELECT * FROM "records" WHERE ("records"."id" = 1)
SELECT * FROM "subjects" WHERE ("subjects"."id" = 2031241678)

  def update
    @record = Record.find params[:id]
    @subject = Subject.find params[:subject_id]
    if @record.update_attributes params[:record]
---
SELECT * FROM "records" WHERE ("records"."id" = 1)
SELECT * FROM "subjects" WHERE ("subjects"."id" = 2031241678)
UPDATE "records" SET "updated_at" = '2009-11-25 21:17:04', "title" = 'Caso da Chuva de Ovos', "body" = 'Posição da atlética: