Fase 5/nerd/app/controllers/reminders_controller.rb

  def new
    @reminder = Reminder.new
    case params[:item_type].downcase
    when 'task'
      @item = Task.find params[:item_id]
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 2)

  def create
    params[:reminder][:date] = params[:reminder][:date].gsub "/", "-"
    @reminder = Reminder.new params[:reminder]
    if @reminder.save
---
INSERT INTO "reminders" ("created_at", "updated_at", "time", "date", "item_id", "item_type") VALUES('2009-11-27 21:23:17', '2009-11-27 21:23:17', 3, '1200-12-11', 2, 'Task')