Fase 5/nerd/app/controllers/subjects_controller.rb

SELECT * FROM "subjects"
---
  def index
    @subjects = Subject.find :all

INSERT INTO "subjects" ("created_at", "title", "updated_at") VALUES('2009-11-15 00:58:49', 'Depósito', '2009-11-15 00:58:49')
---
  def create
    @subject = Subject.new params[:subject]
    if @subject.save

SELECT * FROM "subjects" WHERE ("subjects"."id" = 2089548107)
DELETE FROM "subjects" WHERE ("id" IN (2089548107))
---
  def destroy
    @subject = Subject.find params[:id]
    @subject.delete

SELECT * FROM "subjects" WHERE ("subjects"."id" = 2089548111)
---
  def show
    @subject = Subject.find params[:id]

SELECT * FROM "subjects" WHERE ("subjects"."id" = 2031241678)
---
  def edit
    @subject = Subject.find params[:id]

SELECT * FROM "subjects" WHERE ("subjects"."id" = 2031241678)
UPDATE "subjects" SET "updated_at" = '2009-11-18 20:58:45', "title" = 'Hugo O Maximo' WHERE "id" = 2089548118
---
  def update
    @subject = Subject.find params[:id]
    if @subject.update_attributes params[:subject]