Fase 5/nerd/app/controllers/tasks_controller.rb

SELECT * FROM "tasks" WHERE ("tasks"."id" = 281513492)
SELECT * FROM "subjects" WHERE ("subjects"."id" = 2089548103)
---
  def show
    @task = Task.find params[:id]
    @subject = Subject.find params[:subject_id]

SELECT * FROM "subjects" WHERE ("subjects"."id" = 2089548103)
SELECT * FROM "members"
---
  def new
    @task = Task.new
    @subject = Subject.find params[:subject_id]
    @members = Member.find :all

SELECT * FROM "subjects" WHERE ("subjects"."id" = 2031241678)
INSERT INTO "tasks" ("created_at", "title", "body", "updated_at", "subject_id", "due_date", "status_id") VALUES('2009-11-21 01:38:23', 'Ir na reunião', 'A reunião será na FAU às 21h00.', '2009-11-21 01:38:23', 2031241678, NULL, NULL)
---
  def create
    params[:task][:due_date] = params[:task][:due_date].gsub "/", "-"
    @subject = Subject.find params[:subject_id]
    @task = Task.new params[:task]
    if @task.save

SELECT * FROM "tasks" WHERE ("tasks"."id" = 1407023934)
DELETE FROM "tasks" WHERE "id" = 1407023934
---
  def destroy
    @task = Task.find params[:id]
    @task.destroy

SELECT * FROM "tasks" WHERE ("tasks"."id" = 281513492)
SELECT * FROM "subjects" WHERE ("subjects"."id" = 2031241678)
SELECT * FROM "members"
---
  def edit
    @task = Task.find params[:id]
    @subject = Subject.find params[:subject_id]
    @members = Member.find :all

SELECT * FROM "tasks" WHERE ("tasks"."id" = 1407023933)
SELECT * FROM "subjects" WHERE ("subjects"."id" = 2089548104)
UPDATE "tasks" SET "updated_at" = '2009-11-21 19:37:41', "title" = 'new title' WHERE "id" = 281513492
---
  def update
    @task = Task.find params[:id]
    @subject = Subject.find params[:subject_id]
    if @task.update_attributes params[:task]

SELECT * FROM "tasks" WHERE ("tasks"."id" = 1407023936)
UPDATE "tasks" SET "updated_at" = '2009-11-21 20:03:50', "status_id" = 401453378 WHERE "id" = 1407023936
---
  def change_status
    @task = Task.find params[:id]
    @task.update_attribute :status, Status.next(@task.status)